yuangezhizao/Regina/platforms/Regina/sdkconfig.defaults
# IDF TARGET
CONFIG_IDF_TARGET="esp32c6"

# FLASH
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y

# ARDUINO ESP32
CONFIG_AUTOSTART_ARDUINO=n

# FREERTOS
CONFIG_FREERTOS_HZ=1000

# DIAGNOSTICS
CONFIG_DIAG_USE_EXTERNAL_LOG_WRAP=y
